elcritch/nesper/esp-idf-examples/net_pppos_usb/sdkconfig.defaults.ppp
# PPPoS dual-CDC (CDC0=PPP, CDC1=console)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_APP_NO_BLOBS=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# LWIP PPP
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_PPP_PAP_SUPPORT=y
CONFIG_LWIP_PPP_CHAP_SUPPORT=y
CONFIG_LWIP_ENABLE_LCP_ECHO=y
# CONFIG_LWIP_DEBUG=y
CONFIG_LWIP_PPP_DEBUG_ON=y

# TinyUSB
CONFIG_TINYUSB_DEBUG_LEVEL=02
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=2
CONFIG_TINYUSB_NET_MODE_NONE=y

